spec/fixtures/vcr_cassettes/create_payout_account.yml

---
http_interactions:
- request:
    method: post
    uri: https://api.stripe.com/v1/recipients
    body:
      encoding: US-ASCII
      string: name=Joe%20Sak&type=individual&bank_account[country]=US&bank_account[routing_number]=110000000&bank_account[account_number]=000123456789
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.16.0
      Authorization:
      - Bearer sk_test_UU7bBFT4BMFznL5a35ZE0CIx
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.16.0","lang":"ruby","lang_version":"2.1.2 p95 (2014-05-08)","platform":"x86_64-darwin13.0","publisher":"stripe","uname":"Darwin
        pluto.local 14.0.0 Darwin Kernel Version 14.0.0: Fri Sep 19 00:26:44 PDT 2014;
        root:xnu-2782.1.97~2/RELEASE_X86_64 x86_64"}'
      Content-Length:
      - '136'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Wed, 12 Nov 2014 06:46:03 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '718'
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - 83aeab5c-62b2-46c9-a279-6841e5fcd0c6
      Stripe-Version:
      - '2014-09-08'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "rp_14xutD2L7z1ZOsnrYyxhhFRL",
          "object": "recipient",
          "created": 1415774763,
          "livemode": false,
          "type": "individual",
          "description": null,
          "email": null,
          "name": "Joe Sak",
          "verified": false,
          "metadata": {},
          "active_account": {
            "object": "bank_account",
            "id": "ba_14xutD2L7z1ZOsnrsdMfpDwy",
            "last4": "6789",
            "country": "US",
            "currency": "usd",
            "status": "new",
            "fingerprint": "XJGQs2pPWYzzow5E",
            "bank_name": "STRIPE TEST BANK",
            "default_for_currency": false
          },
          "cards": {
            "object": "list",
            "total_count": 0,
            "has_more": false,
            "url": "/v1/recipients/rp_14xutD2L7z1ZOsnrYyxhhFRL/cards",
            "data": []
          },
          "default_card": null
        }
    http_version: 
  recorded_at: Wed, 12 Nov 2014 06:46:03 GMT
recorded_with: VCR 2.9.3
